In [1]:
import pandas as pd

In [7]:
file = "../DATA/nobel.json"

In [12]:
nobelDF = pd.read_json(file)
nobelDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 646 entries, 0 to 645
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   prizes  646 non-null    object
dtypes: object(1)
memory usage: 5.2+ KB

In [13]:
# 418p 12장

In [14]:
nobelDF

                                                prizes
0    {'year': '2019', 'category': 'chemistry', 'lau...
1    {'year': '2019', 'category': 'economics', 'lau...
2    {'year': '2019', 'category': 'literature', 'la...
3    {'year': '2019', 'category': 'peace', 'laureat...
4    {'year': '2019', 'category': 'physics', 'overa...
..                                                 ...
641  {'year': '1901', 'category': 'chemistry', 'lau...
642  {'year': '1901', 'category': 'literature', 'la...
643  {'year': '1901', 'category': 'peace', 'laureat...
644  {'year': '1901', 'category': 'physics', 'laure...
645  {'year': '1901', 'category': 'medicine', 'laur...

[646 rows x 1 columns]

In [15]:
print(nobelDF.head(3), nobelDF.tail(3), sep="\n\n")

                                              prizes
0  {'year': '2019', 'category': 'chemistry', 'lau...
1  {'year': '2019', 'category': 'economics', 'lau...
2  {'year': '2019', 'category': 'literature', 'la...

                                                prizes
643  {'year': '1901', 'category': 'peace', 'laureat...
644  {'year': '1901', 'category': 'physics', 'laure...
645  {'year': '1901', 'category': 'medicine', 'laur...

## <hr>(4) 데이터 추출

In [17]:
# 행 추출
nobelDF.iloc[0] # SR

prizes    {'year': '2019', 'category': 'chemistry', 'lau...
Name: 0, dtype: object

In [21]:
nobelDF.iloc[0]["prizes"] # Dict

{'year': '2019',
 'category': 'chemistry',
 'laureates': [{'id': '976',
   'firstname': 'John',
   'surname': 'Goodenough',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'},
  {'id': '977',
   'firstname': 'M. Stanley',
   'surname': 'Whittingham',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'},
  {'id': '978',
   'firstname': 'Akira',
   'surname': 'Yoshino',
   'motivation': '"for the development of lithium-ion batteries"',
   'share': '3'}]}

In [22]:
oneData = nobelDF.iloc[0]["prizes"]

In [27]:
for k, v in oneData.items():
    print(f"k = {k}\nv = {v}")

k = year
v = 2019
k = category
v = chemistry
k = laureates
v = [{'id': '976', 'firstname': 'John', 'surname': 'Goodenough', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}, {'id': '977', 'firstname': 'M. Stanley', 'surname': 'Whittingham', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}, {'id': '978', 'firstname': 'Akira', 'surname': 'Yoshino', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}]

In [29]:
for k, v in oneData.items():
    print(f"k = {k}\nv = {v}")
    if k == "laureates":
        for d in v:
            for k2, v2 in d.items():
                print(f"k2 = {k2}\nv2 = {v2}")

k = year
v = 2019
k = category
v = chemistry
k = laureates
v = [{'id': '976', 'firstname': 'John', 'surname': 'Goodenough', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}, {'id': '977', 'firstname': 'M. Stanley', 'surname': 'Whittingham', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}, {'id': '978', 'firstname': 'Akira', 'surname': 'Yoshino', 'motivation': '"for the development of lithium-ion batteries"', 'share': '3'}]
k2 = id
v2 = 976
k2 = firstname
v2 = John
k2 = surname
v2 = Goodenough
k2 = motivation
v2 = "for the development of lithium-ion batteries"
k2 = share
v2 = 3
k2 = id
v2 = 977
k2 = firstname
v2 = M. Stanley
k2 = surname
v2 = Whittingham
k2 = motivation
v2 = "for the development of lithium-ion batteries"
k2 = share
v2 = 3
k2 = id
v2 = 978
k2 = firstname
v2 = Akira
k2 = surname
v2 = Yoshino
k2 = motivation
v2 = "for the development of lithium-ion batteries"
k2 = share
v2 = 3

In [ ]:
- json 중첩 데이터의 다중 반복문 = > 다중 리스트 형태 처리 : 평탄화, 정규화

In [30]:
pd.json_normalize(oneData)

   year   category                                          laureates
0  2019  chemistry  [{'id': '976', 'firstname': 'John', 'surname':...

In [31]:
pd.json_normalize(oneData, record_path="laureates")

,id,firstname,surname,motivation,share
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3

In [34]:
pd.json_normalize(oneData, record_path="laureates", meta=['year', 'category'])

,id,firstname,surname,motivation,share,year,category
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3,2019,chemistry
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3,2019,chemistry
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3,2019,chemistry

In [36]:
# 컬럼 읽기 => DF객체변수명["컬럼명"], Df객체변수명.컬럼명
nobelDF.prizes

0      {'year': '2019', 'category': 'chemistry', 'lau...
1      {'year': '2019', 'category': 'economics', 'lau...
2      {'year': '2019', 'category': 'literature', 'la...
3      {'year': '2019', 'category': 'peace', 'laureat...
4      {'year': '2019', 'category': 'physics', 'overa...
                             ...
641    {'year': '1901', 'category': 'chemistry', 'lau...
642    {'year': '1901', 'category': 'literature', 'la...
643    {'year': '1901', 'category': 'peace', 'laureat...
644    {'year': '1901', 'category': 'physics', 'laure...
645    {'year': '1901', 'category': 'medicine', 'laur...
Name: prizes, Length: 646, dtype: object

In [37]:
pd.json_normalize(nobelDF.prizes, record_path="laureates")

KeyError: "Key 'laureates' not found. If specifying a record_path, all elements of data should have the path."

In [38]:
# 일부 행은 laureates가 없어서 에러가 나는 것임
# 즉 record path에 넣으려면 모든 행에 해당 col값이 존재해야함
# 존재하지 않는 행에는? 해당하는 key를 추가한다
nobelDF.prizes

0      {'year': '2019', 'category': 'chemistry', 'lau...
1      {'year': '2019', 'category': 'economics', 'lau...
2      {'year': '2019', 'category': 'literature', 'la...
3      {'year': '2019', 'category': 'peace', 'laureat...
4      {'year': '2019', 'category': 'physics', 'overa...
                             ...
641    {'year': '1901', 'category': 'chemistry', 'lau...
642    {'year': '1901', 'category': 'literature', 'la...
643    {'year': '1901', 'category': 'peace', 'laureat...
644    {'year': '1901', 'category': 'physics', 'laure...
645    {'year': '1901', 'category': 'medicine', 'laur...
Name: prizes, Length: 646, dtype: object

In [41]:
for data in nobelDF.prizes:
    # print(type(data), data.keys(), end="\n\n") # 딕셔너리 원소 -> 'laureates'가 없으면 추가시켜 주셈!!!
    data.setdefault('laureates', []) # 없으면 넣고 있으면 걍 둔다는 뜻!!

In [46]:
nobelDF2 = pd.json_normalize(nobelDF.prizes, record_path="laureates", meta=['year', 'category']) # 426p
nobelDF2

,id,firstname,surname,motivation,share,year,category
0,976,John,Goodenough,"""for the development of lithium-ion batteries""",3,2019,chemistry
1,977,M. Stanley,Whittingham,"""for the development of lithium-ion batteries""",3,2019,chemistry
2,978,Akira,Yoshino,"""for the development of lithium-ion batteries""",3,2019,chemistry
3,982,Abhijit,Banerjee,"""for their experimental approach to alleviatin...",3,2019,economics
4,983,Esther,Duflo,"""for their experimental approach to alleviatin...",3,2019,economics
...,...,...,...,...,...,...,...
945,569,Sully,Prudhomme,"""in special recognition of his poetic composit...",1,1901,literature
946,462,Henry,Dunant,"""for his humanitarian efforts to help wounded ...",2,1901,peace
947,463,Frédéric,Passy,"""for his lifelong work for international peace...",2,1901,peace
948,1,Wilhelm Conrad,Röntgen,"""in recognition of the extraordinary services ...",1,1901,physics
949,293,Emil,von Behring,"""for his work on serum therapy, especially its...",1,1901,medicine

In [ ]:
# apply = 파이썬의 map같은 존재임!!

## <hr>(7) JSON의 다양한 방식의 DataFrame 저장하기 => orient 파라미터

In [53]:
# list like
json_data='''
[
    {"id" : "1","name":"sravan","age":22},
    {"id" : "2","name":"harsha","age":22},
    {"id" : "3","name":"deepika","age":21},
    {"id" : "4","name":"jyothika","age":23}
]
''' # 데이터 => 키 : 값

- orient = "record" 설정 => JSON 파일 데이터를 행 단위로 읽어서 DF에 저장 (데이터를 보고 결정할 것)

In [54]:
pd.read_json(json_data, orient="records")

   id      name  age
0   1    sravan   22
1   2    harsha   22
2   3   deepika   21
3   4  jyothika   23

In [55]:
# dict like
json_data2='''
{
    "student1": {"id" : "1","name":"sravan","age":22},
    "student2": {"id" : "2","name":"harsha","age":22},
    "student3": {"id" : "3","name":"deepika","age":21},
    "student4": {"id" : "4","name":"jyothika","age":23}
}
''' # 데이터 => 키 : 값

In [56]:
pd.read_json(json_data2, orient="index") # 키를 인덱스로 주겠다는 뜻

          id      name  age
student1   1    sravan   22
student2   2    harsha   22
student3   3   deepika   21
student4   4  jyothika   23

In [57]:
pd.read_json(json_data2, orient="columns") # 키를 인덱스로 주겠다는 뜻

     student1 student2 student3  student4
id          1        2        3         4
name   sravan   harsha  deepika  jyothika
age        22       22       21        23

In [58]:
pd.read_json(json_data2, orient="index").T

     student1 student2 student3  student4
id          1        2        3         4
name   sravan   harsha  deepika  jyothika
age        22       22       21        23

In [59]:
# list like : 값만 있음!! 
json_data3 = '''
[
    [ "1", "sravan",22 ],
    [ "2", "harsha",22 ],
    [ "3", "deepika",21 ],
    [ "4", "jyothika",23 ]
]
'''

In [62]:
pd.read_json(json_data3) # orient = "values"랑 같은 상태

   0         1   2
0  1    sravan  22
1  2    harsha  22
2  3   deepika  21
3  4  jyothika  23